{"categories":{"General":["what_is","issue_tracker","how_works","benefits"],"Financial":["pledges","who_pledges"]},"topics":{"what_is":{"title":"What is Crowdlink?","body":"Crowdlink is a platform for better communication between developers and end-users.\nUsers can contribute towards projects they enjoy by making pledges or voting on\nnew features and bugfixes. Developers can gain insight into their community's\nneeds, and financial support for a growing project.\n","breif":"Crowdlink is a platform for better communication between developers and end-users."},"issue_tracker":{"title":"Is Crowdlink an issue tracker?","body":"<b>Not in the traditional sense.</b> Although you could certainly use it that way.\nCrowdlink is designed to offer a logical workflow with community involvement integrated\nthroughout the process. The idea is to target issues at a much higher level than\ntraditional issue trackers, IE. users may note a specific symptom of a bug they would really like\nfixed, without necessarily having any idea as to the cause or solution. The goal is\nto support decision making and project direction, rather than focusing on implementation details.\n","brief":"Crowdlink is designed to allow developers to make informed project direction decisions, rather than focusing on specific implementation details."},"how_works":{"title":"How does Crowdlink work?","body":"Crowdlink is built to by quite flexible, but a typical use case might be as follows:\n<br>\n<ul>\n<li>A user has a great idea to improve a project</li>\n<li>This user locates the project on Crowdlink and they create a new issue + solution for their idea</li>\n<li>The user makes a pledge towards its completion</li>\n<li>While viewing the project the user notices a couple other ideas he really likes, and pledges towards those too</li>\n<li>Developers, excited by the interest in the project, take note of popular issues.</li>\n<li>After careful consideration they select or reject an issue or solution to let users know how they are going forward.</li>\n<li>If a solution is completed the developers receive the pledges.</li>\n</ul>\n","breif":"Users make pledges towards issues or solutions. Developers may complete those to receive the pledges."},"benefits":{"title":"Why use Crowdlink?","body":"<ul>\n<li>Watch projects you are interested in and see what direction they are moving</li>\n<li>Easily determine which issues are most important to end users</li>\n<li>Encourage & motivate developers who see interest in their project</li>\n<li>Maintain a logical workflow of issues</li>\n<li>Help developers make financial ends meet</li>\n</ul>\n","breif":"Crowdlink helps motivate developers, increases communication between devs and end users, and helps starving devs pay their bills."},"differences":{"title":"How is Crowdlink different from other Crowdfunding sites, like BountySource or Gittip?","body":"Crowdlink is a paradigm shift from other sites. Most other sites focus on incenting/rewarding devs,\nand we agree that aspect is important, but what really makes a project great (or horrible) is the community.\nCrowdlink is designed to grow that community. Involve users in the decision making process. Give developers\nvaluable information about what the users want. Philosophy aside, there are also several key\narchitectural differences\n<br><ul>\n<li><b>Microtransactions</b> - Its simple to make one, non-recurring donation or pledge.</li>\n<li><b>Project focused</b> - Supporting developers is important, and Crowdlink does that,\nbut the focus is really on getting everyone working together</li>\n<li><b>Empowering</b> - Crowdlink gives project maintainers ultimate control over both project direction and fund distribution.</li>\n","breif":"Much community. So crowdfund. Wow."},"pledges":{"title":"What are Pledges and how do they work?","body":"A Pledge is a monetary endorsement of an idea. Crowdlink allows Pledges to be placed on both Proposed Solutions (ideas for improving a project)\nand Accepted Solutions (Solutions that have been approved by project admins). Once a Solution is marked as completed the funds in a Pledge are\ndispursed by a project admin.\n","breif":"Much community. So crowdfund. Wow."},"unused_solutions":{"title":"What happens to a Pledge if a Solution is not accepted?","body":"It gets returned to the contributor","breif":"Much community. So crowdfund. Wow."}}}
